#+TITLE: Emacs configuration
#+AUTHOR: conrad82

** anaconda-mode
   [[https://github.com/proofit404/anaconda-mode]]
   https://www.reddit.com/r/emacs/comments/bg0rue/your_opinion_on_best_config_for_python_development/elht7ak/?utm_source=share&utm_medium=ios_app&utm_name=iossmf
   As you see, I use the default bindings. I switch to virtual environment using M-x pythonic-activate (pythonic is a dependency of anaconda-mode). I jump to definition via M-.. Autocompletion works via C-M-i and you get nice candidate list if you have ivy installed. There is also default binding for help but I don't use it. I think there is a way to eval region but I don't use it since I develop Python libraries and do related interactive testing in Jupyter notebook (actually, in emacs-jupyter, but that's a different story.)

   #+BEGIN_SRC emacs-lisp
   (setq python-shell-interpreter "/bin/python3")
   (use-package anaconda-mode
    :ensure t
    :init 
    (add-hook 'python-mode-hook 'anaconda-mode)
    (add-hook 'python-mode-hook 'anaconda-eldoc-mode)
    (add-hook 'python-mode-hook 'display-line-numbers-mode))

    (eval-after-load "company"
     '(add-to-list 'company-backends 'company-anaconda))
   #+END_SRC

   #+RESULTS:
   | company-anaconda | company-bbdb | company-eclim | company-semantic | company-clang | company-xcode | company-cmake | company-capf | company-files | (company-dabbrev-code company-gtags company-etags company-keywords) | company-oddmuse | company-dabbrev |

** org-caldav
   https://github.com/dengste/org-caldav
   Credentials stored in =~/.authinfo.gpg=
   GPG key was generated using =gpg --gen-key=, password stored in gnome keyring.
   #+BEGIN_SRC emacs-lisp
   (use-package org-caldav
    :defer t

    :init
    ; Caldav settings
    (setq org-caldav-url             "https://server.home/remote.php/dav/calendars/conrad82")
    (setq org-caldav-calendar-id     "org")
    (setq org-caldav-inbox           "~/Nextcloud/org/caldav.org")
    (setq org-caldav-files           '("~/Nextcloud/org/gtd.org"))
    (setq org-caldav-save-directory  "~/Nextcloud/org/caldav")
    (setq org-icalendar-timezone     "Europe/Paris")) 

    (setq org-caldav-skip-conditions '(nottimestamp))
    (setq org-caldav-delete-org-entries 'always)
    (setq org-caldav-delete-calendar-entries 'always)
    (setq org-caldav-show-sync-results nil)

    ; icalendar settings
    (setq org-icalendar-alarm-time 60)
    
    ; Sync settings
    (add-hook 'kill-emacs-hook    'org-caldav-sync)
    (add-hook 'emacs-startup-hook 'org-caldav-sync)
    ; (add-hook 'after-save-hook    'org-caldav-sync)
   #+END_SRC

   #+RESULTS:
   | org-caldav-sync |

** Initial settings and paths
    Getting started, keyboard shortcuts from the manual
    Source: https://orgmode.org/guide/Activation.html#Activation
    #+BEGIN_SRC emacs-lisp
    (global-set-key "\C-cl" 'org-store-link)
    (global-set-key "\C-ca" 'org-agenda)
    (global-set-key "\C-cc" 'org-capture)
    (global-set-key "\C-cb" 'org-switchb)
    #+END_SRC

    #+RESULTS:
    : org-switchb
  
    Variables:
    #+BEGIN_SRC emacs-lisp
    (setq org-directory "~/Nextcloud/org")
    (setq org-agenda-files (file-expand-wildcards "~/Nextcloud/org/*.org"))
    (setq org-refile-targets '((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9)))
    #+END_SRC

    #+RESULTS:
    : ((nil :maxlevel . 9) (org-agenda-files :maxlevel . 9))

** Auto-save and auto-revert
   to minimize sync conflicts with beorg

   Turn on auto-revert buffer. 
   In case org-files are left open, while using beorg on phone
   #+BEGIN_SRC emacs-lisp
   (global-auto-revert-mode 1)
   #+END_SRC

   Based on https://christiantietze.de/posts/2019/03/sync-emacs-org-files/
   Auto-save org buffers
   #+BEGIN_SRC emacs-lisp
   (add-hook 'auto-save-hook 'org-save-all-org-buffers)
   #+END_SRC

   #+RESULTS:
   | org-save-all-org-buffers |

** Startup size
   #+BEGIN_SRC emacs-lisp
   (add-to-list 'default-frame-alist '(fullscreen . maximized))
   ;;(setq initial-frame-alist '((top . 1) (left . 1) (width . 135) (height . 95)))
   ;;(toggle-frame-fullscreen)
   #+END_SRC

   #+RESULTS:
   : ((fullscreen . maximized))

** Open file on startup
   #+BEGIN_SRC emacs-lisp
   (treemacs)
   (find-file "~/Nextcloud/org/gtd.org")
   (delete-other-windows)
   #+END_SRC

   #+RESULTS:
   : #<buffer gtd.org>

